SiliconLabs/sdk_support/platform/Device/SiliconLabs/EFR32MR21/Include/efr32mr21_protimer.h
/**************************************************************************//**
 * @file
 * @brief EFR32MR21 PROTIMER register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32MR21_PROTIMER_H
#define EFR32MR21_PROTIMER_H
#define PROTIMER_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32MR21_PROTIMER PROTIMER
 * @{
 * @brief EFR32MR21 PROTIMER Register Declaration.
 *****************************************************************************/

/** PROTIMER CC Register Group Declaration. */
typedef struct {
  __IOM uint32_t CTRL;                               /**< CC Channel Control Register                        */
  __IOM uint32_t PRE;                                /**< CC Channel PRE Value Register                      */
  __IOM uint32_t BASE;                               /**< CC Channel BASE Value Register                     */
  __IOM uint32_t WRAP;                               /**< CC Channel WRAP Value Register                     */
} PROTIMER_CC_TypeDef;

/** PROTIMER Register Declaration. */
typedef struct {
  __IM uint32_t       IPVERSION;                /**< IPVERSION                                          */
  __IOM uint32_t      EN;                       /**< EN                                                 */
  __IOM uint32_t      CTRL;                     /**< Control Register                                   */
  __IOM uint32_t      CMD;                      /**< Command Register                                   */
  __IOM uint32_t      PRSCTRL;                  /**< PRS Channel selection                              */
  __IM uint32_t       STATUS;                   /**< Status Register                                    */
  __IOM uint32_t      PRECNT;                   /**< Pre Counter Value                                  */
  __IOM uint32_t      BASECNT;                  /**< Base Counter Value                                 */
  __IOM uint32_t      WRAPCNT;                  /**< Wrap Counter Value                                 */
  __IM uint32_t       BASEPRE;                  /**< Base and Pre counter values                        */
  __IM uint32_t       LWRAPCNT;                 /**< Latched Wrap Counter Value                         */
  __IOM uint32_t      PRECNTTOPADJ;             /**< PRECNT Top Adjust Value                            */
  __IOM uint32_t      PRECNTTOP;                /**< PRECNT Top Value                                   */
  __IOM uint32_t      BASECNTTOP;               /**< BASECNT Top Value                                  */
  __IOM uint32_t      WRAPCNTTOP;               /**< WRAPCNT Top Value Register                         */
  __IOM uint32_t      TOUT0CNT;                 /**< TOUT0CNT Value Register                            */
  __IOM uint32_t      TOUT0CNTTOP;              /**< TOUT0CNTTOP Value Register.                        */
  __IOM uint32_t      TOUT0COMP;                /**< TOUT0COMP Register                                 */
  __IOM uint32_t      TOUT1CNT;                 /**< TOUT1CNT Value Register                            */
  __IOM uint32_t      TOUT1CNTTOP;              /**< TOUT1CNTTOP Value Register.                        */
  __IOM uint32_t      TOUT1COMP;                /**< TOUT1COMP Register                                 */
  __IOM uint32_t      LBTCTRL;                  /**< Listen Before Talk Wait Control                    */
  __IOM uint32_t      LBTPRSCTRL;               /**< PRS Channel selection                              */
  __IOM uint32_t      LBTSTATE;                 /**< Listen Before Talk State                           */
  __IOM uint32_t      RANDOM;                   /**< Pseudo Random Generator Value Register             */
  __IOM uint32_t      IF;                       /**< Interrupt Flag Register                            */
  uint32_t            RESERVED0[2U];            /**< Reserved for future use                            */
  __IOM uint32_t      IEN;                      /**< Interrupt Enable Register                          */
  __IOM uint32_t      RXCTRL;                   /**< RX request signal from Protimer                    */
  __IOM uint32_t      TXCTRL;                   /**< TX request signal from Protimer                    */
  __IOM uint32_t      ETSI;                     /**< Support ETSI LBT                                   */
  __IOM uint32_t      LBTSTATE1;                /**< Listen Before Talk State                           */
  __IOM uint32_t      RANDOMFW0;                /**< GENERATED LINEAR RANDOM VALUE                      */
  __IOM uint32_t      RANDOMFW1;                /**< GENERATED LINEAR RANDOM VALUE                      */
  __IOM uint32_t      RANDOMFW2;                /**< GENERATED LINEAR RANDOM VALUE                      */
  uint32_t            RESERVED1[28U];           /**< Reserved for future use                            */
  PROTIMER_CC_TypeDef CC[8U];                   /**< Compare/Capture Channel                            */
  uint32_t            RESERVED2[928U];          /**< Reserved for future use                            */
  __IM uint32_t       IPVERSION_SET;            /**< IPVERSION                                          */
  __IOM uint32_t      EN_SET;                   /**< EN                                                 */
  __IOM uint32_t      CTRL_SET;                 /**< Control Register                                   */
  __IOM uint32_t      CMD_SET;                  /**< Command Register                                   */
  __IOM uint32_t      PRSCTRL_SET;              /**< PRS Channel selection                              */
  __IM uint32_t       STATUS_SET;               /**< Status Register                                    */
  __IOM uint32_t      PRECNT_SET;               /**< Pre Counter Value                                  */
  __IOM uint32_t      BASECNT_SET;              /**< Base Counter Value                                 */
  __IOM uint32_t      WRAPCNT_SET;              /**< Wrap Counter Value                                 */
  __IM uint32_t       BASEPRE_SET;              /**< Base and Pre counter values                        */
  __IM uint32_t       LWRAPCNT_SET;             /**< Latched Wrap Counter Value                         */
  __IOM uint32_t      PRECNTTOPADJ_SET;         /**< PRECNT Top Adjust Value                            */
  __IOM uint32_t      PRECNTTOP_SET;            /**< PRECNT Top Value                                   */
  __IOM uint32_t      BASECNTTOP_SET;           /**< BASECNT Top Value                                  */
  __IOM uint32_t      WRAPCNTTOP_SET;           /**< WRAPCNT Top Value Register                         */
  __IOM uint32_t      TOUT0CNT_SET;             /**< TOUT0CNT Value Register                            */
  __IOM uint32_t      TOUT0CNTTOP_SET;          /**< TOUT0CNTTOP Value Register.                        */
  __IOM uint32_t      TOUT0COMP_SET;            /**< TOUT0COMP Register                                 */
  __IOM uint32_t      TOUT1CNT_SET;             /**< TOUT1CNT Value Register                            */
  __IOM uint32_t      TOUT1CNTTOP_SET;          /**< TOUT1CNTTOP Value Register.                        */
  __IOM uint32_t      TOUT1COMP_SET;            /**< TOUT1COMP Register                                 */
  __IOM uint32_t      LBTCTRL_SET;              /**< Listen Before Talk Wait Control                    */
  __IOM uint32_t      LBTPRSCTRL_SET;           /**< PRS Channel selection                              */
  __IOM uint32_t      LBTSTATE_SET;             /**< Listen Before Talk State                           */
  __IOM uint32_t      RANDOM_SET;               /**< Pseudo Random Generator Value Register             */
  __IOM uint32_t      IF_SET;                   /**< Interrupt Flag Register                            */
  uint32_t            RESERVED3[2U];            /**< Reserved for future use                            */
  __IOM uint32_t      IEN_SET;                  /**< Interrupt Enable Register                          */
  __IOM uint32_t      RXCTRL_SET;               /**< RX request signal from Protimer                    */
  __IOM uint32_t      TXCTRL_SET;               /**< TX request signal from Protimer                    */
  __IOM uint32_t      ETSI_SET;                 /**< Support ETSI LBT                                   */
  __IOM uint32_t      LBTSTATE1_SET;            /**< Listen Before Talk State                           */
  __IOM uint32_t      RANDOMFW0_SET;            /**< GENERATED LINEAR RANDOM VALUE                      */
  __IOM uint32_t      RANDOMFW1_SET;            /**< GENERATED LINEAR RANDOM VALUE                      */
  __IOM uint32_t      RANDOMFW2_SET;            /**< GENERATED LINEAR RANDOM VALUE                      */
  uint32_t            RESERVED4[28U];           /**< Reserved for future use                            */
  PROTIMER_CC_TypeDef CC_SET[8U];               /**< Compare/Capture Channel                            */
  uint32_t            RESERVED5[928U];          /**< Reserved for future use                            */
  __IM uint32_t       IPVERSION_CLR;            /**< IPVERSION                                          */
  __IOM uint32_t      EN_CLR;                   /**< EN                                                 */
  __IOM uint32_t      CTRL_CLR;                 /**< Control Register                                   */
  __IOM uint32_t      CMD_CLR;                  /**< Command Register                                   */
  __IOM uint32_t      PRSCTRL_CLR;              /**< PRS Channel selection                              */
  __IM uint32_t       STATUS_CLR;               /**< Status Register                                    */
  __IOM uint32_t      PRECNT_CLR;               /**< Pre Counter Value                                  */
  __IOM uint32_t      BASECNT_CLR;              /**< Base Counter Value                                 */
  __IOM uint32_t      WRAPCNT_CLR;              /**< Wrap Counter Value                                 */
  __IM uint32_t       BASEPRE_CLR;              /**< Base and Pre counter values                        */
  __IM uint32_t       LWRAPCNT_CLR;             /**< Latched Wrap Counter Value                         */
  __IOM uint32_t      PRECNTTOPADJ_CLR;         /**< PRECNT Top Adjust Value                            */
  __IOM uint32_t      PRECNTTOP_CLR;            /**< PRECNT Top Value                                   */
  __IOM uint32_t      BASECNTTOP_CLR;           /**< BASECNT Top Value                                  */
  __IOM uint32_t      WRAPCNTTOP_CLR;           /**< WRAPCNT Top Value Register                         */
  __IOM uint32_t      TOUT0CNT_CLR;             /**< TOUT0CNT Value Register                            */
  __IOM uint32_t      TOUT0CNTTOP_CLR;          /**< TOUT0CNTTOP Value Register.                        */
  __IOM uint32_t      TOUT0COMP_CLR;            /**< TOUT0COMP Register                                 */
  __IOM uint32_t      TOUT1CNT_CLR;             /**< TOUT1CNT Value Register                            */
  __IOM uint32_t      TOUT1CNTTOP_CLR;          /**< TOUT1CNTTOP Value Register.                        */
  __IOM uint32_t      TOUT1COMP_CLR;            /**< TOUT1COMP Register                                 */
  __IOM uint32_t      LBTCTRL_CLR;              /**< Listen Before Talk Wait Control                    */
  __IOM uint32_t      LBTPRSCTRL_CLR;           /**< PRS Channel selection                              */
  __IOM uint32_t      LBTSTATE_CLR;             /**< Listen Before Talk State                           */
  __IOM uint32_t      RANDOM_CLR;               /**< Pseudo Random Generator Value Register             */
  __IOM uint32_t      IF_CLR;                   /**< Interrupt Flag Register                            */
  uint32_t            RESERVED6[2U];            /**< Reserved for future use                            */
  __IOM uint32_t      IEN_CLR;                  /**< Interrupt Enable Register                          */
  __IOM uint32_t      RXCTRL_CLR;               /**< RX request signal from Protimer                    */
  __IOM uint32_t      TXCTRL_CLR;               /**< TX request signal from Protimer                    */
  __IOM uint32_t      ETSI_CLR;                 /**< Support ETSI LBT                                   */
  __IOM uint32_t      LBTSTATE1_CLR;            /**< Listen Before Talk State                           */
  __IOM uint32_t      RANDOMFW0_CLR;            /**< GENERATED LINEAR RANDOM VALUE                      */
  __IOM uint32_t      RANDOMFW1_CLR;            /**< GENERATED LINEAR RANDOM VALUE                      */
  __IOM uint32_t      RANDOMFW2_CLR;            /**< GENERATED LINEAR RANDOM VALUE                      */
  uint32_t            RESERVED7[28U];           /**< Reserved for future use                            */
  PROTIMER_CC_TypeDef CC_CLR[8U];               /**< Compare/Capture Channel                            */
  uint32_t            RESERVED8[928U];          /**< Reserved for future use                            */
  __IM uint32_t       IPVERSION_TGL;            /**< IPVERSION                                          */
  __IOM uint32_t      EN_TGL;                   /**< EN                                                 */
  __IOM uint32_t      CTRL_TGL;                 /**< Control Register                                   */
  __IOM uint32_t      CMD_TGL;                  /**< Command Register                                   */
  __IOM uint32_t      PRSCTRL_TGL;              /**< PRS Channel selection                              */
  __IM uint32_t       STATUS_TGL;               /**< Status Register                                    */
  __IOM uint32_t      PRECNT_TGL;               /**< Pre Counter Value                                  */
  __IOM uint32_t      BASECNT_TGL;              /**< Base Counter Value                                 */
  __IOM uint32_t      WRAPCNT_TGL;              /**< Wrap Counter Value                                 */
  __IM uint32_t       BASEPRE_TGL;              /**< Base and Pre counter values                        */
  __IM uint32_t       LWRAPCNT_TGL;             /**< Latched Wrap Counter Value                         */
  __IOM uint32_t      PRECNTTOPADJ_TGL;         /**< PRECNT Top Adjust Value                            */
  __IOM uint32_t      PRECNTTOP_TGL;            /**< PRECNT Top Value                                   */
  __IOM uint32_t      BASECNTTOP_TGL;           /**< BASECNT Top Value                                  */
  __IOM uint32_t      WRAPCNTTOP_TGL;           /**< WRAPCNT Top Value Register                         */
  __IOM uint32_t      TOUT0CNT_TGL;             /**< TOUT0CNT Value Register                            */
  __IOM uint32_t      TOUT0CNTTOP_TGL;          /**< TOUT0CNTTOP Value Register.                        */
  __IOM uint32_t      TOUT0COMP_TGL;            /**< TOUT0COMP Register                                 */
  __IOM uint32_t      TOUT1CNT_TGL;             /**< TOUT1CNT Value Register                            */
  __IOM uint32_t      TOUT1CNTTOP_TGL;          /**< TOUT1CNTTOP Value Register.                        */
  __IOM uint32_t      TOUT1COMP_TGL;            /**< TOUT1COMP Register                                 */
  __IOM uint32_t      LBTCTRL_TGL;              /**< Listen Before Talk Wait Control                    */
  __IOM uint32_t      LBTPRSCTRL_TGL;           /**< PRS Channel selection                              */
  __IOM uint32_t      LBTSTATE_TGL;             /**< Listen Before Talk State                           */
  __IOM uint32_t      RANDOM_TGL;               /**< Pseudo Random Generator Value Register             */
  __IOM uint32_t      IF_TGL;                   /**< Interrupt Flag Register                            */
  uint32_t            RESERVED9[2U];            /**< Reserved for future use                            */
  __IOM uint32_t      IEN_TGL;                  /**< Interrupt Enable Register                          */
  __IOM uint32_t      RXCTRL_TGL;               /**< RX request signal from Protimer                    */
  __IOM uint32_t      TXCTRL_TGL;               /**< TX request signal from Protimer                    */
  __IOM uint32_t      ETSI_TGL;                 /**< Support ETSI LBT                                   */
  __IOM uint32_t      LBTSTATE1_TGL;            /**< Listen Before Talk State                           */
  __IOM uint32_t      RANDOMFW0_TGL;            /**< GENERATED LINEAR RANDOM VALUE                      */
  __IOM uint32_t      RANDOMFW1_TGL;            /**< GENERATED LINEAR RANDOM VALUE                      */
  __IOM uint32_t      RANDOMFW2_TGL;            /**< GENERATED LINEAR RANDOM VALUE                      */
  uint32_t            RESERVED10[28U];          /**< Reserved for future use                            */
  PROTIMER_CC_TypeDef CC_TGL[8U];               /**< Compare/Capture Channel                            */
} PROTIMER_TypeDef;
/** @} End of group EFR32MR21_PROTIMER */

/**************************************************************************//**
 * @addtogroup EFR32MR21_PROTIMER
 * @{
 * @defgroup EFR32MR21_PROTIMER_BitFields PROTIMER Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for PROTIMER IPVERSION */
#define _PROTIMER_IPVERSION_RESETVALUE                   0x00000000UL                                 /**< Default value for PROTIMER_IPVERSION        */
#define _PROTIMER_IPVERSION_MASK                         0xFFFFFFFFUL                                 /**< Mask for PROTIMER_IPVERSION                 */
#define _PROTIMER_IPVERSION_IPVERSION_SHIFT              0                                            /**< Shift value for PROTIMER_IPVERSION          */
#define _PROTIMER_IPVERSION_IPVERSION_MASK               0xFFFFFFFFUL                                 /**< Bit mask for PROTIMER_IPVERSION             */
#define _PROTIMER_IPVERSION_IPVERSION_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_IPVERSION         */
#define PROTIMER_IPVERSION_IPVERSION_DEFAULT             (_PROTIMER_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_IPVERSION */

