SiliconLabs/sdk_support/platform/Device/SiliconLabs/EFR32MR21/Include/efr32mr21_protimer.h
/* Bit fields for PROTIMER RANDOMFW2 */
#define _PROTIMER_RANDOMFW2_RESETVALUE                   0x00000000UL                               /**< Default value for PROTIMER_RANDOMFW2        */
#define _PROTIMER_RANDOMFW2_MASK                         0x0003FFFFUL                               /**< Mask for PROTIMER_RANDOMFW2                 */
#define _PROTIMER_RANDOMFW2_RANDOM6_SHIFT                0                                          /**< Shift value for PROTIMER_RANDOM6            */
#define _PROTIMER_RANDOMFW2_RANDOM6_MASK                 0x1FFUL                                    /**< Bit mask for PROTIMER_RANDOM6               */
#define _PROTIMER_RANDOMFW2_RANDOM6_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for PROTIMER_RANDOMFW2         */
#define PROTIMER_RANDOMFW2_RANDOM6_DEFAULT               (_PROTIMER_RANDOMFW2_RANDOM6_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_RANDOMFW2 */
#define _PROTIMER_RANDOMFW2_RANDOM7_SHIFT                9                                          /**< Shift value for PROTIMER_RANDOM7            */
#define _PROTIMER_RANDOMFW2_RANDOM7_MASK                 0x3FE00UL                                  /**< Bit mask for PROTIMER_RANDOM7               */
#define _PROTIMER_RANDOMFW2_RANDOM7_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for PROTIMER_RANDOMFW2         */
#define PROTIMER_RANDOMFW2_RANDOM7_DEFAULT               (_PROTIMER_RANDOMFW2_RANDOM7_DEFAULT << 9) /**< Shifted mode DEFAULT for PROTIMER_RANDOMFW2 */

/* Bit fields for PROTIMER CC_CTRL */
#define _PROTIMER_CC_CTRL_RESETVALUE                     0x00000000UL                                 /**< Default value for PROTIMER_CC_CTRL          */
#define _PROTIMER_CC_CTRL_MASK                           0x07E07F7FUL                                 /**< Mask for PROTIMER_CC_CTRL                   */
#define PROTIMER_CC_CTRL_ENABLE                          (0x1UL << 0)                                 /**< Channel Enable                              */
#define _PROTIMER_CC_CTRL_ENABLE_SHIFT                   0                                            /**< Shift value for PROTIMER_ENABLE             */
#define _PROTIMER_CC_CTRL_ENABLE_MASK                    0x1UL                                        /**< Bit mask for PROTIMER_ENABLE                */
#define _PROTIMER_CC_CTRL_ENABLE_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define PROTIMER_CC_CTRL_ENABLE_DEFAULT                  (_PROTIMER_CC_CTRL_ENABLE_DEFAULT << 0)      /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_CCMODE                          (0x1UL << 1)                                 /**< Compare/Capture mode                        */
#define _PROTIMER_CC_CTRL_CCMODE_SHIFT                   1                                            /**< Shift value for PROTIMER_CCMODE             */
#define _PROTIMER_CC_CTRL_CCMODE_MASK                    0x2UL                                        /**< Bit mask for PROTIMER_CCMODE                */
#define _PROTIMER_CC_CTRL_CCMODE_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define _PROTIMER_CC_CTRL_CCMODE_COMPARE                 0x00000000UL                                 /**< Mode COMPARE for PROTIMER_CC_CTRL           */
#define _PROTIMER_CC_CTRL_CCMODE_CAPTURE                 0x00000001UL                                 /**< Mode CAPTURE for PROTIMER_CC_CTRL           */
#define PROTIMER_CC_CTRL_CCMODE_DEFAULT                  (_PROTIMER_CC_CTRL_CCMODE_DEFAULT << 1)      /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_CCMODE_COMPARE                  (_PROTIMER_CC_CTRL_CCMODE_COMPARE << 1)      /**< Shifted mode COMPARE for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_CCMODE_CAPTURE                  (_PROTIMER_CC_CTRL_CCMODE_CAPTURE << 1)      /**< Shifted mode CAPTURE for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_PREMATCHEN                      (0x1UL << 2)                                 /**< Enable PRECNT matching                      */
#define _PROTIMER_CC_CTRL_PREMATCHEN_SHIFT               2                                            /**< Shift value for PROTIMER_PREMATCHEN         */
#define _PROTIMER_CC_CTRL_PREMATCHEN_MASK                0x4UL                                        /**< Bit mask for PROTIMER_PREMATCHEN            */
#define _PROTIMER_CC_CTRL_PREMATCHEN_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define PROTIMER_CC_CTRL_PREMATCHEN_DEFAULT              (_PROTIMER_CC_CTRL_PREMATCHEN_DEFAULT << 2)  /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_BASEMATCHEN                     (0x1UL << 3)                                 /**< Enable BASECNT matching                     */
#define _PROTIMER_CC_CTRL_BASEMATCHEN_SHIFT              3                                            /**< Shift value for PROTIMER_BASEMATCHEN        */
#define _PROTIMER_CC_CTRL_BASEMATCHEN_MASK               0x8UL                                        /**< Bit mask for PROTIMER_BASEMATCHEN           */
#define _PROTIMER_CC_CTRL_BASEMATCHEN_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define PROTIMER_CC_CTRL_BASEMATCHEN_DEFAULT             (_PROTIMER_CC_CTRL_BASEMATCHEN_DEFAULT << 3) /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_WRAPMATCHEN                     (0x1UL << 4)                                 /**< Enable WRAPCNT matching                     */
#define _PROTIMER_CC_CTRL_WRAPMATCHEN_SHIFT              4                                            /**< Shift value for PROTIMER_WRAPMATCHEN        */
#define _PROTIMER_CC_CTRL_WRAPMATCHEN_MASK               0x10UL                                       /**< Bit mask for PROTIMER_WRAPMATCHEN           */
#define _PROTIMER_CC_CTRL_WRAPMATCHEN_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define PROTIMER_CC_CTRL_WRAPMATCHEN_DEFAULT             (_PROTIMER_CC_CTRL_WRAPMATCHEN_DEFAULT << 4) /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_OIST                            (0x1UL << 5)                                 /**< Output Initial State                        */
#define _PROTIMER_CC_CTRL_OIST_SHIFT                     5                                            /**< Shift value for PROTIMER_OIST               */
#define _PROTIMER_CC_CTRL_OIST_MASK                      0x20UL                                       /**< Bit mask for PROTIMER_OIST                  */
#define _PROTIMER_CC_CTRL_OIST_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define PROTIMER_CC_CTRL_OIST_DEFAULT                    (_PROTIMER_CC_CTRL_OIST_DEFAULT << 5)        /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_OUTINV                          (0x1UL << 6)                                 /**< Output Invert                               */
#define _PROTIMER_CC_CTRL_OUTINV_SHIFT                   6                                            /**< Shift value for PROTIMER_OUTINV             */
#define _PROTIMER_CC_CTRL_OUTINV_MASK                    0x40UL                                       /**< Bit mask for PROTIMER_OUTINV                */
#define _PROTIMER_CC_CTRL_OUTINV_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define PROTIMER_CC_CTRL_OUTINV_DEFAULT                  (_PROTIMER_CC_CTRL_OUTINV_DEFAULT << 6)      /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define _PROTIMER_CC_CTRL_MOA_SHIFT                      8                                            /**< Shift value for PROTIMER_MOA                */
#define _PROTIMER_CC_CTRL_MOA_MASK                       0x300UL                                      /**< Bit mask for PROTIMER_MOA                   */
#define _PROTIMER_CC_CTRL_MOA_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define _PROTIMER_CC_CTRL_MOA_DISABLED                   0x00000000UL                                 /**< Mode DISABLED for PROTIMER_CC_CTRL          */
#define _PROTIMER_CC_CTRL_MOA_TOGGLE                     0x00000001UL                                 /**< Mode TOGGLE for PROTIMER_CC_CTRL            */
#define _PROTIMER_CC_CTRL_MOA_CLEAR                      0x00000002UL                                 /**< Mode CLEAR for PROTIMER_CC_CTRL             */
#define _PROTIMER_CC_CTRL_MOA_SET                        0x00000003UL                                 /**< Mode SET for PROTIMER_CC_CTRL               */
#define PROTIMER_CC_CTRL_MOA_DEFAULT                     (_PROTIMER_CC_CTRL_MOA_DEFAULT << 8)         /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_MOA_DISABLED                    (_PROTIMER_CC_CTRL_MOA_DISABLED << 8)        /**< Shifted mode DISABLED for PROTIMER_CC_CTRL  */
#define PROTIMER_CC_CTRL_MOA_TOGGLE                      (_PROTIMER_CC_CTRL_MOA_TOGGLE << 8)          /**< Shifted mode TOGGLE for PROTIMER_CC_CTRL    */
#define PROTIMER_CC_CTRL_MOA_CLEAR                       (_PROTIMER_CC_CTRL_MOA_CLEAR << 8)           /**< Shifted mode CLEAR for PROTIMER_CC_CTRL     */
#define PROTIMER_CC_CTRL_MOA_SET                         (_PROTIMER_CC_CTRL_MOA_SET << 8)             /**< Shifted mode SET for PROTIMER_CC_CTRL       */
#define _PROTIMER_CC_CTRL_OFOA_SHIFT                     10                                           /**< Shift value for PROTIMER_OFOA               */
#define _PROTIMER_CC_CTRL_OFOA_MASK                      0xC00UL                                      /**< Bit mask for PROTIMER_OFOA                  */
#define _PROTIMER_CC_CTRL_OFOA_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define _PROTIMER_CC_CTRL_OFOA_DISABLED                  0x00000000UL                                 /**< Mode DISABLED for PROTIMER_CC_CTRL          */
#define _PROTIMER_CC_CTRL_OFOA_TOGGLE                    0x00000001UL                                 /**< Mode TOGGLE for PROTIMER_CC_CTRL            */
#define _PROTIMER_CC_CTRL_OFOA_CLEAR                     0x00000002UL                                 /**< Mode CLEAR for PROTIMER_CC_CTRL             */
#define _PROTIMER_CC_CTRL_OFOA_SET                       0x00000003UL                                 /**< Mode SET for PROTIMER_CC_CTRL               */
#define PROTIMER_CC_CTRL_OFOA_DEFAULT                    (_PROTIMER_CC_CTRL_OFOA_DEFAULT << 10)       /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_OFOA_DISABLED                   (_PROTIMER_CC_CTRL_OFOA_DISABLED << 10)      /**< Shifted mode DISABLED for PROTIMER_CC_CTRL  */
#define PROTIMER_CC_CTRL_OFOA_TOGGLE                     (_PROTIMER_CC_CTRL_OFOA_TOGGLE << 10)        /**< Shifted mode TOGGLE for PROTIMER_CC_CTRL    */
#define PROTIMER_CC_CTRL_OFOA_CLEAR                      (_PROTIMER_CC_CTRL_OFOA_CLEAR << 10)         /**< Shifted mode CLEAR for PROTIMER_CC_CTRL     */
#define PROTIMER_CC_CTRL_OFOA_SET                        (_PROTIMER_CC_CTRL_OFOA_SET << 10)           /**< Shifted mode SET for PROTIMER_CC_CTRL       */
#define _PROTIMER_CC_CTRL_OFSEL_SHIFT                    12                                           /**< Shift value for PROTIMER_OFSEL              */
#define _PROTIMER_CC_CTRL_OFSEL_MASK                     0x3000UL                                     /**< Bit mask for PROTIMER_OFSEL                 */
#define _PROTIMER_CC_CTRL_OFSEL_DEFAULT                  0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define _PROTIMER_CC_CTRL_OFSEL_PRECNT                   0x00000000UL                                 /**< Mode PRECNT for PROTIMER_CC_CTRL            */
#define _PROTIMER_CC_CTRL_OFSEL_BASECNT                  0x00000001UL                                 /**< Mode BASECNT for PROTIMER_CC_CTRL           */
#define _PROTIMER_CC_CTRL_OFSEL_WRAPCNT                  0x00000002UL                                 /**< Mode WRAPCNT for PROTIMER_CC_CTRL           */
#define _PROTIMER_CC_CTRL_OFSEL_DISABLED                 0x00000003UL                                 /**< Mode DISABLED for PROTIMER_CC_CTRL          */
#define PROTIMER_CC_CTRL_OFSEL_DEFAULT                   (_PROTIMER_CC_CTRL_OFSEL_DEFAULT << 12)      /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_OFSEL_PRECNT                    (_PROTIMER_CC_CTRL_OFSEL_PRECNT << 12)       /**< Shifted mode PRECNT for PROTIMER_CC_CTRL    */
#define PROTIMER_CC_CTRL_OFSEL_BASECNT                   (_PROTIMER_CC_CTRL_OFSEL_BASECNT << 12)      /**< Shifted mode BASECNT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_OFSEL_WRAPCNT                   (_PROTIMER_CC_CTRL_OFSEL_WRAPCNT << 12)      /**< Shifted mode WRAPCNT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_OFSEL_DISABLED                  (_PROTIMER_CC_CTRL_OFSEL_DISABLED << 12)     /**< Shifted mode DISABLED for PROTIMER_CC_CTRL  */
#define PROTIMER_CC_CTRL_PRSCONF                         (0x1UL << 14)                                /**< PRS Configuration                           */
#define _PROTIMER_CC_CTRL_PRSCONF_SHIFT                  14                                           /**< Shift value for PROTIMER_PRSCONF            */
#define _PROTIMER_CC_CTRL_PRSCONF_MASK                   0x4000UL                                     /**< Bit mask for PROTIMER_PRSCONF               */
#define _PROTIMER_CC_CTRL_PRSCONF_DEFAULT                0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define _PROTIMER_CC_CTRL_PRSCONF_PULSE                  0x00000000UL                                 /**< Mode PULSE for PROTIMER_CC_CTRL             */
#define _PROTIMER_CC_CTRL_PRSCONF_LEVEL                  0x00000001UL                                 /**< Mode LEVEL for PROTIMER_CC_CTRL             */
#define PROTIMER_CC_CTRL_PRSCONF_DEFAULT                 (_PROTIMER_CC_CTRL_PRSCONF_DEFAULT << 14)    /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_PRSCONF_PULSE                   (_PROTIMER_CC_CTRL_PRSCONF_PULSE << 14)      /**< Shifted mode PULSE for PROTIMER_CC_CTRL     */
#define PROTIMER_CC_CTRL_PRSCONF_LEVEL                   (_PROTIMER_CC_CTRL_PRSCONF_LEVEL << 14)      /**< Shifted mode LEVEL for PROTIMER_CC_CTRL     */
#define _PROTIMER_CC_CTRL_INSEL_SHIFT                    21                                           /**< Shift value for PROTIMER_INSEL              */
#define _PROTIMER_CC_CTRL_INSEL_MASK                     0x1E00000UL                                  /**< Bit mask for PROTIMER_INSEL                 */
#define _PROTIMER_CC_CTRL_INSEL_DEFAULT                  0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define _PROTIMER_CC_CTRL_INSEL_PRS                      0x00000000UL                                 /**< Mode PRS for PROTIMER_CC_CTRL               */
#define _PROTIMER_CC_CTRL_INSEL_TXDONE                   0x00000001UL                                 /**< Mode TXDONE for PROTIMER_CC_CTRL            */
#define _PROTIMER_CC_CTRL_INSEL_RXDONE                   0x00000002UL                                 /**< Mode RXDONE for PROTIMER_CC_CTRL            */
#define _PROTIMER_CC_CTRL_INSEL_TXORRXDONE               0x00000003UL                                 /**< Mode TXORRXDONE for PROTIMER_CC_CTRL        */
#define _PROTIMER_CC_CTRL_INSEL_FRAMEDET0                0x00000004UL                                 /**< Mode FRAMEDET0 for PROTIMER_CC_CTRL         */
#define _PROTIMER_CC_CTRL_INSEL_FRAMEDET1                0x00000005UL                                 /**< Mode FRAMEDET1 for PROTIMER_CC_CTRL         */
#define _PROTIMER_CC_CTRL_INSEL_FDET0OR1                 0x00000006UL                                 /**< Mode FDET0OR1 for PROTIMER_CC_CTRL          */
#define _PROTIMER_CC_CTRL_INSEL_MODSYNCSENT              0x00000007UL                                 /**< Mode MODSYNCSENT for PROTIMER_CC_CTRL       */
#define _PROTIMER_CC_CTRL_INSEL_RXEOF                    0x00000008UL                                 /**< Mode RXEOF for PROTIMER_CC_CTRL             */
#define _PROTIMER_CC_CTRL_INSEL_PRORTC0                  0x00000009UL                                 /**< Mode PRORTC0 for PROTIMER_CC_CTRL           */
#define _PROTIMER_CC_CTRL_INSEL_PRORTC1                  0x0000000AUL                                 /**< Mode PRORTC1 for PROTIMER_CC_CTRL           */
#define PROTIMER_CC_CTRL_INSEL_DEFAULT                   (_PROTIMER_CC_CTRL_INSEL_DEFAULT << 21)      /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_INSEL_PRS                       (_PROTIMER_CC_CTRL_INSEL_PRS << 21)          /**< Shifted mode PRS for PROTIMER_CC_CTRL       */
#define PROTIMER_CC_CTRL_INSEL_TXDONE                    (_PROTIMER_CC_CTRL_INSEL_TXDONE << 21)       /**< Shifted mode TXDONE for PROTIMER_CC_CTRL    */
#define PROTIMER_CC_CTRL_INSEL_RXDONE                    (_PROTIMER_CC_CTRL_INSEL_RXDONE << 21)       /**< Shifted mode RXDONE for PROTIMER_CC_CTRL    */
#define PROTIMER_CC_CTRL_INSEL_TXORRXDONE                (_PROTIMER_CC_CTRL_INSEL_TXORRXDONE << 21)   /**< Shifted mode TXORRXDONE for PROTIMER_CC_CTRL*/
#define PROTIMER_CC_CTRL_INSEL_FRAMEDET0                 (_PROTIMER_CC_CTRL_INSEL_FRAMEDET0 << 21)    /**< Shifted mode FRAMEDET0 for PROTIMER_CC_CTRL */
#define PROTIMER_CC_CTRL_INSEL_FRAMEDET1                 (_PROTIMER_CC_CTRL_INSEL_FRAMEDET1 << 21)    /**< Shifted mode FRAMEDET1 for PROTIMER_CC_CTRL */
#define PROTIMER_CC_CTRL_INSEL_FDET0OR1                  (_PROTIMER_CC_CTRL_INSEL_FDET0OR1 << 21)     /**< Shifted mode FDET0OR1 for PROTIMER_CC_CTRL  */
#define PROTIMER_CC_CTRL_INSEL_MODSYNCSENT               (_PROTIMER_CC_CTRL_INSEL_MODSYNCSENT << 21)  /**< Shifted mode MODSYNCSENT for PROTIMER_CC_CTRL*/
#define PROTIMER_CC_CTRL_INSEL_RXEOF                     (_PROTIMER_CC_CTRL_INSEL_RXEOF << 21)        /**< Shifted mode RXEOF for PROTIMER_CC_CTRL     */
#define PROTIMER_CC_CTRL_INSEL_PRORTC0                   (_PROTIMER_CC_CTRL_INSEL_PRORTC0 << 21)      /**< Shifted mode PRORTC0 for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_INSEL_PRORTC1                   (_PROTIMER_CC_CTRL_INSEL_PRORTC1 << 21)      /**< Shifted mode PRORTC1 for PROTIMER_CC_CTRL   */
#define _PROTIMER_CC_CTRL_ICEDGE_SHIFT                   25                                           /**< Shift value for PROTIMER_ICEDGE             */
#define _PROTIMER_CC_CTRL_ICEDGE_MASK                    0x6000000UL                                  /**< Bit mask for PROTIMER_ICEDGE                */
#define _PROTIMER_CC_CTRL_ICEDGE_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_CC_CTRL           */
#define _PROTIMER_CC_CTRL_ICEDGE_RISING                  0x00000000UL                                 /**< Mode RISING for PROTIMER_CC_CTRL            */
#define _PROTIMER_CC_CTRL_ICEDGE_FALLING                 0x00000001UL                                 /**< Mode FALLING for PROTIMER_CC_CTRL           */
#define _PROTIMER_CC_CTRL_ICEDGE_BOTH                    0x00000002UL                                 /**< Mode BOTH for PROTIMER_CC_CTRL              */
#define _PROTIMER_CC_CTRL_ICEDGE_DISABLED                0x00000003UL                                 /**< Mode DISABLED for PROTIMER_CC_CTRL          */
#define PROTIMER_CC_CTRL_ICEDGE_DEFAULT                  (_PROTIMER_CC_CTRL_ICEDGE_DEFAULT << 25)     /**< Shifted mode DEFAULT for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_ICEDGE_RISING                   (_PROTIMER_CC_CTRL_ICEDGE_RISING << 25)      /**< Shifted mode RISING for PROTIMER_CC_CTRL    */
#define PROTIMER_CC_CTRL_ICEDGE_FALLING                  (_PROTIMER_CC_CTRL_ICEDGE_FALLING << 25)     /**< Shifted mode FALLING for PROTIMER_CC_CTRL   */
#define PROTIMER_CC_CTRL_ICEDGE_BOTH                     (_PROTIMER_CC_CTRL_ICEDGE_BOTH << 25)        /**< Shifted mode BOTH for PROTIMER_CC_CTRL      */
#define PROTIMER_CC_CTRL_ICEDGE_DISABLED                 (_PROTIMER_CC_CTRL_ICEDGE_DISABLED << 25)    /**< Shifted mode DISABLED for PROTIMER_CC_CTRL  */

/* Bit fields for PROTIMER CC_PRE */
#define _PROTIMER_CC_PRE_RESETVALUE                      0x00000000UL                        /**< Default value for PROTIMER_CC_PRE           */
#define _PROTIMER_CC_PRE_MASK                            0x0000FFFFUL                        /**< Mask for PROTIMER_CC_PRE                    */
#define _PROTIMER_CC_PRE_PRE_SHIFT                       0                                   /**< Shift value for PROTIMER_PRE                */
#define _PROTIMER_CC_PRE_PRE_MASK                        0xFFFFUL                            /**< Bit mask for PROTIMER_PRE                   */
#define _PROTIMER_CC_PRE_PRE_DEFAULT                     0x00000000UL                        /**< Mode DEFAULT for PROTIMER_CC_PRE            */
#define PROTIMER_CC_PRE_PRE_DEFAULT                      (_PROTIMER_CC_PRE_PRE_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_CC_PRE    */

/* Bit fields for PROTIMER CC_BASE */
#define _PROTIMER_CC_BASE_RESETVALUE                     0x00000000UL                          /**< Default value for PROTIMER_CC_BASE          */
#define _PROTIMER_CC_BASE_MASK                           0x0000FFFFUL                          /**< Mask for PROTIMER_CC_BASE                   */
#define _PROTIMER_CC_BASE_BASE_SHIFT                     0                                     /**< Shift value for PROTIMER_BASE               */
#define _PROTIMER_CC_BASE_BASE_MASK                      0xFFFFUL                              /**< Bit mask for PROTIMER_BASE                  */
#define _PROTIMER_CC_BASE_BASE_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for PROTIMER_CC_BASE           */
#define PROTIMER_CC_BASE_BASE_DEFAULT                    (_PROTIMER_CC_BASE_BASE_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_CC_BASE   */

/* Bit fields for PROTIMER CC_WRAP */
#define _PROTIMER_CC_WRAP_RESETVALUE                     0x00000000UL                          /**< Default value for PROTIMER_CC_WRAP          */
#define _PROTIMER_CC_WRAP_MASK                           0xFFFFFFFFUL                          /**< Mask for PROTIMER_CC_WRAP                   */
#define _PROTIMER_CC_WRAP_WRAP_SHIFT                     0                                     /**< Shift value for PROTIMER_WRAP               */
#define _PROTIMER_CC_WRAP_WRAP_MASK                      0xFFFFFFFFUL                          /**< Bit mask for PROTIMER_WRAP                  */
#define _PROTIMER_CC_WRAP_WRAP_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for PROTIMER_CC_WRAP           */
#define PROTIMER_CC_WRAP_WRAP_DEFAULT                    (_PROTIMER_CC_WRAP_WRAP_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_CC_WRAP   */

/** @} End of group EFR32MR21_PROTIMER_BitFields */
/** @} End of group EFR32MR21_PROTIMER */
/** @} End of group Parts */

#endif /* EFR32MR21_PROTIMER_H */
